Tekla.Structures.Plugins.DirectManipulation.Services.Tools.PlacingManipulator
The Tekla.Structures.Plugins.DirectManipulation.Services.Tools.PlacingManipulator class wraps the Tekla.BIM.DirectManipulation.Services.Manipulators.CoordinateSystemManipulator as an internal class inherited from Tekla.Structures.Plugins.DirectManipulation.Core.ManipulatorBase.
Remarks:
This manipulator might be removed later. At the moment the user should not have access to this manipulator.
Tekla.Structures.Plugins.DirectManipulation.Core.ManipulatorBase

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.PlacingManipulator.internalManipulator
The internal manipulator.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.PlacingManipulator.#ctor(System.Object,Tekla.Structures.Plugins.DirectManipulation.Core.ManipulationContext,Tekla.BIM.Geometry.CoordinateSystem3,System.Double)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Tools.PlacingManipulator class.
parent: The parent.
manipulationContext: The manipulation context.
coordinateSystem: The coordinate system.
radius: The radius.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.PlacingManipulator.CoordinateSystem
Gets or sets the underlying Tekla.BIM.Geometry.CoordinateSystem3 value.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.PlacingManipulator.Radius
Gets or sets the radius defining the outer boundaries of the manipulator.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.PlacingManipulator.ReferenceLength
Gets or sets the reference length of the manipulator.
Remarks:
The reference length defines the threshold at which the radius should start to scale down in accordance with the zoom level.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.PlacingManipulator.Selected
Gets a value indicating whether any of the coordinate system handles is selected.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.PlacingManipulator.Parent
Gets or sets the parent.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.PlacingManipulator.AttachToManipulatorService(Tekla.BIM.DirectManipulation.Services.Manipulators.IManipulatorService)


Tekla.Structures.Plugins.DirectManipulation.Services.Tools.PlacingManipulator.Dispose(System.Boolean)


Tekla.Structures.Plugins.DirectManipulation.Services.Tools.PlacingManipulator.OnChangeEnded(Tekla.BIM.DirectManipulation.Services.Manipulators.CoordinateSystemManipulator,System.Boolean)
Event handler for the Tekla.BIM.DirectManipulation.Services.Manipulators.CoordinateSystemManipulator.ChangeEnded event.
manipulator: The manipulator.
isInterrupted: If set to true the handler should not do anything.

Tekla.Structures.Plugins.DirectManipulation.Services.Tools.PlacingManipulator.Update
Updates this instance.